interestEUTypes.tex
% Created 2017-05-21 Sun 18:54
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage[colorlinks=true]{hyperref}
\usepackage{tikz}
\usepackage{parskip}
\setlength{\parindent}{0cm}
\author{Mario Román}
\date{\today}
\title{Statement of Interest\\\medskip
\large EUTypes Summer School 2017}
\hypersetup{
 pdfauthor={Mario Román},
 pdftitle={Statement of Interest},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.0.50 (Org mode 9.0.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\emph{To the organising comitee of EUTypes Summer School,}

\(\quad\)

I am a student of two bachelor degrees in Mathematics and Computer
Science. I am working on homological algebra and category theory. My
research is supported by an introduction to research grant of the
Spanish government. I am writing my bachelor thesis on lambda calculus
and category theory applied to functional programming.

My primary interest lies in the field of type systems as foundations
of mathematics and logic. I started learning Haskell three years
ago, at the same time I began learning category theory. Since
then, I have implemented lambda calculus-based interpreters on
Haskell, written short proofs on Coq and started studying about type
theory. I am very interested in the introduction to Agda, and the
courses about the logic of type systems and Homotopy Type Theory.

This summer school would be a great opportunity for me to gain some
advanced training on type theory, proof assistants and their
underlying mathematics; to help me decide what specific topics of
research I would like to work on during my career, and to network with students
and professors working on this field.

\(\quad\)

\emph{Sincerely, Mario Román.}
\end{document}